cmsis-svd/cmsis-svd/data/Fujitsu/MB9AFAAxL.xml
      </registers>
    </peripheral>
    <!-- PERIPHERAL "LCDC" -->
    <peripheral>
      <name>LCDC</name>
      <description>LCD Controller</description>
      <groupName>LCDC</groupName>
      <baseAddress>0x40032000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x28</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "LCDC" -->
      <interrupt>
        <name>LCDC</name>
        <value>29</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "LCDCC1" -->
        <register>
          <name>LCDCC1</name>
          <description>LCDC Control Register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7C</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDEN" -->
            <field>
              <name>LCDEN</name>
              <description>Timer mode operation enable bit </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VSEL" -->
            <field>
              <name>VSEL</name>
              <description>LCD drive power control bit </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MS" -->
            <field>
              <name>MS</name>
              <description>LCD controller display mode selection bits</description>
              <lsb>2</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDCC2" -->
        <register>
          <name>LCDCC2</name>
          <description>LCDC Control Register 2</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x14</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RSEL" -->
            <field>
              <name>RSEL</name>
              <description>Divider resistor value selection bit</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLS8" -->
            <field>
              <name>BLS8</name>
              <description>8 COM mode bias selection bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INV" -->
            <field>
              <name>INV</name>
              <description>Reverse display control bit </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BK" -->
            <field>
              <name>BK</name>
              <description>Blank display control bit </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LCDIEN" -->
            <field>
              <name>LCDIEN</name>
              <description>Interrupt enable bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LCDIF" -->
            <field>
              <name>LCDIF</name>
              <description>Interrupt request detection bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDCC3" -->
        <register>
          <name>LCDCC3</name>
          <description>LCDC Control Register 3</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x3E</resetValue>
          <resetMask>0xFE</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PICTL" -->
            <field>
              <name>PICTL</name>
              <description>I/O port input control bit </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLSEL" -->
            <field>
              <name>BLSEL</name>
              <description>Blink interval selection bit</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VE4" -->
            <field>
              <name>VE4</name>
              <description>VV4 selection bit </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VE3" -->
            <field>
              <name>VE3</name>
              <description>VV3 selection bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VE2" -->
            <field>
              <name>VE2</name>
              <description>VV2 selection bit </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VE1" -->
            <field>
              <name>VE1</name>
              <description>VV1 selection bit </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VE0" -->
            <field>
              <name>VE0</name>
              <description>VV0 selection bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDC_PSR" -->
        <register>
          <name>LCDC_PSR</name>
          <description>LCDC Clock Prescaler Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x007FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CLKSEL" -->
            <field>
              <name>CLKSEL</name>
              <description>Source clock selection bit </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKDIV" -->
            <field>
              <name>CLKDIV</name>
              <description>LCDC clock division ratio setting bit</description>
              <lsb>0</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
