cmsis-svd/cmsis-svd/data/Fujitsu/MB9AFAAxL.xml
        <!-- REGISTER "LCDC_COMEN" -->
        <register>
          <name>LCDC_COMEN</name>
          <description>LCDC COM Output Enable Register</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "COM7" -->
            <field>
              <name>COM7</name>
              <description>Dual purpose COM/SEG port control bits</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "COM6" -->
            <field>
              <name>COM6</name>
              <description>Dual purpose COM/SEG port control bits</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "COM5" -->
            <field>
              <name>COM5</name>
              <description>Dual purpose COM/SEG port control bits</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "COM4" -->
            <field>
              <name>COM4</name>
              <description>Dual purpose COM/SEG port control bits</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "COM3" -->
            <field>
              <name>COM3</name>
              <description>Dual purpose COM port control bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "COM2" -->
            <field>
              <name>COM2</name>
              <description>Dual purpose COM port control bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "COM1" -->
            <field>
              <name>COM1</name>
              <description>Dual purpose COM port control bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "COM0" -->
            <field>
              <name>COM0</name>
              <description>Dual purpose COM port control bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDC_SEGEN1" -->
        <register>
          <name>LCDC_SEGEN1</name>
          <description>LCDC SEG Output Enable Register 1</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFB83803</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEG31" -->
            <field>
              <name>SEG31</name>
              <description>Segment 31</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG30" -->
            <field>
              <name>SEG30</name>
              <description>Segment 30</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG29" -->
            <field>
              <name>SEG29</name>
              <description>Segment 29</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG28" -->
            <field>
              <name>SEG28</name>
              <description>Segment 28</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG27" -->
            <field>
              <name>SEG27</name>
              <description>Segment 27</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG26" -->
            <field>
              <name>SEG26</name>
              <description>Segment 26</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG25" -->
            <field>
              <name>SEG25</name>
              <description>Segment 25</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG24" -->
            <field>
              <name>SEG24</name>
              <description>Segment 24</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG23" -->
            <field>
              <name>SEG23</name>
              <description>Segment 23</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG21" -->
            <field>
              <name>SEG21</name>
              <description>Segment 21</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG20" -->
            <field>
              <name>SEG20</name>
              <description>Segment 20</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG19" -->
            <field>
              <name>SEG19</name>
              <description>Segment 19</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG13" -->
            <field>
              <name>SEG13</name>
              <description>Segment 13</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG12" -->
            <field>
              <name>SEG12</name>
              <description>Segment 12</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG11" -->
            <field>
              <name>SEG11</name>
              <description>Segment 11</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG01" -->
            <field>
              <name>SEG01</name>
              <description>Segment 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG00" -->
            <field>
              <name>SEG00</name>
              <description>Segment 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
