cmsis-svd/cmsis-svd/data/Fujitsu/MB9AFAAxL.xml
        <!-- REGISTER "SFREE" -->
        <register>
          <name>SFREE</name>
          <description>Signal Free Time Setting Register</description>
          <addressOffset>0xC</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SFREE" -->
            <field>
              <name>SFREE</name>
              <description>Signal free time setting bits</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCST" -->
        <register>
          <name>RCST</name>
          <description>Reception Interrupt Control Register</description>
          <addressOffset>0x40</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STIE" -->
            <field>
              <name>STIE</name>
              <description>Start bit interrupt enable bit </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACKIE" -->
            <field>
              <name>ACKIE</name>
              <description> ACK interrupt enable bit </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OVFIE" -->
            <field>
              <name>OVFIE</name>
              <description>Counter overflow interrupt enable bit </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OVFSEL" -->
            <field>
              <name>OVFSEL</name>
              <description>Counter overflow detection condition setting bit</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ST" -->
            <field>
              <name>ST</name>
              <description>Start bit detection bit </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACK" -->
            <field>
              <name>ACK</name>
              <description>ACK: ACK detection bit </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EOM" -->
            <field>
              <name>EOM</name>
              <description>EOM detection bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OVF" -->
            <field>
              <name>OVF</name>
              <description>Counter overflow detection bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCCR" -->
        <register>
          <name>RCCR</name>
          <description>Reception Control Register</description>
          <addressOffset>0x41</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x8F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "THSEL" -->
            <field>
              <name>THSEL</name>
              <description>Threshold selection bit </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADRCE" -->
            <field>
              <name>ADRCE</name>
              <description>Address comparison enable bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD1" -->
            <field>
              <name>MOD1</name>
              <description>Operation mode setting bits</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD0" -->
            <field>
              <name>MOD0</name>
              <description>Operation mode setting bits</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN" -->
            <field>
              <name>EN</name>
              <description>Operation enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCDAHW" -->
        <register>
          <name>RCDAHW</name>
          <description>"H" Width Setting Register A</description>
          <addressOffset>0x44</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCDAHW" -->
            <field>
              <name>RCDAHW</name>
              <description>"H" Width Setting A</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCSHW" -->
        <register>
          <name>RCSHW</name>
          <description>Start Bit "H" Width Setting Register</description>
          <addressOffset>0x45</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCSHW" -->
            <field>
              <name>RCSHW</name>
              <description>Start Bit "H" Width Setting</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCDBHW" -->
        <register>
          <name>RCDBHW</name>
          <description>"H" Width Setting Register B</description>
          <addressOffset>0x49</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCDBHW" -->
            <field>
              <name>RCDBHW</name>
              <description>"H" Width Setting B</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
